arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
            // Discard any received data
            m_carriage_return_received = false;
            m_receive_buffer_len = 0;
            m_is_first_ota_packet = false;

            if (m_on_event) {
            	BLEServiceEvent e;
            	e.event_type = BLEServiceEventType::DISCONNECTED;
                (void)m_on_event(e);
            }
            // Reprise explicite (le SDK ne le fait plus, cf. advertising_init):
            // en configuration, un telephone qui se deconnecte doit pouvoir se
            // reconnecter; apres un stop(), la radio doit rester eteinte.
            if (m_advertising_wanted)
                advertising_start();
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
				.tx_phys = BLE_GAP_PHY_AUTO,
                .rx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling events from the GATT library. */
void BleInterface::gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
void BleInterface::nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the events from the STM OTA BLE Service.
 *
 * @details This function will process the events received from the STM OTA BLE Service
 *
 * @param[in] p_evt       STM OTA Service event.
 */
/**@snippet [Handling the data received over BLE] */
void BleInterface::stm_ota_event_handler(uint16_t conn_handle, ble_stm_ota_t * p_stm_ota, ble_stm_ota_event_t * p_evt)
{
	BLEServiceEvent s_evt;
	switch (p_evt->event_type)
	{
		case STM_OTA_EVENT_ACTION:
		{
			if (p_evt->action == STM_OTA_ACTION_START_WIRELESS ||
			    p_evt->action == STM_OTA_ACTION_START_USER_APP)
			{
				// The next receive raw data packet will contain at least 8 bytes
				// which shall include the total file size and a CRC32 checksum
				m_is_first_ota_packet = true;
				m_ota_file_id = p_evt->address;  // Record file ID

				// Send handshake back to client to inform them that we receive their
				// start request
				uint8_t status[3] = { STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_START_UPLOAD_OK };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
			}
			else if (p_evt->action == STM_OTA_ACTION_STOP_ALL ||
					p_evt->action == STM_OTA_ACTION_CANCEL)
			{
				s_evt.event_type = BLEServiceEventType::OTA_ABORT;
				m_on_event(s_evt);
				uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
			}
			else if (p_evt->action == STM_OTA_ACTION_UPLOAD_FINISHED)
			{
				s_evt.event_type = BLEServiceEventType::OTA_END;
				try {
					m_on_event(s_evt);
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_OK, STM_OTA_STATUS_INTEGRITY_OK, STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				} catch (ErrorCode e) {
					DEBUG_TRACE("OTA_END: Got error: %u", e);
					if (OTA_TRANSFER_CRC_ERROR == e) {
						uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_OK, STM_OTA_STATUS_INTEGRITY_NOT_OK, STM_OTA_STATUS_IGNORE };
						ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
						break;
					} else {
						uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
						ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
					}
				}
			}
		}
		break;
		case STM_OTA_EVENT_RAW_DATA:
		{
			if (m_is_first_ota_packet)
			{
				// If the length is less than 8 bytes then flag an error
				if (p_evt->length < 8)
				{
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
					return;
				}

				m_is_first_ota_packet = false;

				// Debug: print first 16 bytes of OTA packet
				DEBUG_TRACE("OTA first packet (%u bytes): %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X",
					p_evt->length,
					p_evt->length > 0 ? ((uint8_t *)p_evt->p_data)[0] : 0,
					p_evt->length > 1 ? ((uint8_t *)p_evt->p_data)[1] : 0,
					p_evt->length > 2 ? ((uint8_t *)p_evt->p_data)[2] : 0,
					p_evt->length > 3 ? ((uint8_t *)p_evt->p_data)[3] : 0,
					p_evt->length > 4 ? ((uint8_t *)p_evt->p_data)[4] : 0,
					p_evt->length > 5 ? ((uint8_t *)p_evt->p_data)[5] : 0,
					p_evt->length > 6 ? ((uint8_t *)p_evt->p_data)[6] : 0,
					p_evt->length > 7 ? ((uint8_t *)p_evt->p_data)[7] : 0,
					p_evt->length > 8 ? ((uint8_t *)p_evt->p_data)[8] : 0,
					p_evt->length > 9 ? ((uint8_t *)p_evt->p_data)[9] : 0,
					p_evt->length > 10 ? ((uint8_t *)p_evt->p_data)[10] : 0,
					p_evt->length > 11 ? ((uint8_t *)p_evt->p_data)[11] : 0,
					p_evt->length > 12 ? ((uint8_t *)p_evt->p_data)[12] : 0,
					p_evt->length > 13 ? ((uint8_t *)p_evt->p_data)[13] : 0,
					p_evt->length > 14 ? ((uint8_t *)p_evt->p_data)[14] : 0,
					p_evt->length > 15 ? ((uint8_t *)p_evt->p_data)[15] : 0);

				s_evt.event_type = BLEServiceEventType::OTA_START;
				s_evt.file_id = m_ota_file_id;
				s_evt.file_size = ((uint8_t *)p_evt->p_data)[3] |
						((uint8_t *)p_evt->p_data)[2] << 8 |
						((uint8_t *)p_evt->p_data)[1] << 16 |
						((uint8_t *)p_evt->p_data)[0] << 24;
				s_evt.crc32 = ((uint8_t *)p_evt->p_data)[7] |
						((uint8_t *)p_evt->p_data)[6] << 8 |
						((uint8_t *)p_evt->p_data)[5] << 16 |
						((uint8_t *)p_evt->p_data)[4] << 24;

				// Notify start event
				try {
					m_on_event(s_evt);
				} catch (ErrorCode e) {
					// Exception raised, indicate the procedure failed
					DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				}

				// If any bytes remain then pass these on as file data
				if (p_evt->length > 8)
				{
					s_evt.event_type = BLEServiceEventType::OTA_FILE_DATA;
					s_evt.data = (uint8_t *)p_evt->p_data + 8;
					s_evt.length = p_evt->length - 8;

					// Notify file data
					try {
						m_on_event(s_evt);
					} catch (ErrorCode e) {
						// Exception raised, indicate the procedure failed
						DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
						uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
						ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
					}
				}
			}
			else
			{
				s_evt.event_type = BLEServiceEventType::OTA_FILE_DATA;
				s_evt.data = p_evt->p_data;
				s_evt.length = p_evt->length;

