arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
				try {
					m_on_event(s_evt);
				} catch (ErrorCode e) {
					// Exception raised, indicate the procedure failed
					DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				}
			}
		}
		break;
		default:
			break;
	}
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
void BleInterface::nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        if (!m_carriage_return_received)
        {
            // If receiving this data would overrun our buffer then we need to discard what we already have to prevent the buffer from filling and not being cleared
            if (m_receive_buffer_len + p_evt->params.rx_data.length > sizeof(m_receive_buffer))
                m_receive_buffer_len = 0;

            if (p_evt->params.rx_data.length > sizeof(m_receive_buffer))
            {
                DEBUG_WARN("BleInterface::nus_data_handler: received data from BLE NUS larger than buffer.");
            }
            else
            {
                memcpy(&m_receive_buffer[m_receive_buffer_len], p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                m_receive_buffer_len = m_receive_buffer_len + p_evt->params.rx_data.length;
                DEBUG_TRACE("BleInterface::nus_data_handler: received %u bytes cumulative %u (%03x).", p_evt->params.rx_data.length, m_receive_buffer_len, m_receive_buffer_len);
                if (m_receive_buffer_len > 0 && m_receive_buffer[m_receive_buffer_len - 1] == '\r')
                    m_carriage_return_received = true;

                // Notify the user that we have a string waiting to be read with readline()
                // only if end line is received
                if (m_on_event && m_carriage_return_received) {
                	BLEServiceEvent e;
                	e.event_type = BLEServiceEventType::DTE_DATA_RECEIVED;
                    (void)m_on_event(e);
                }
            }
        }
        else
        {
            DEBUG_WARN("BleInterface::nus_data_handler: Received data from BLE NUS. But discarded as buffer already contains a string.");
        }

#if 0
        DEBUG_TRACE("BleInterface::nus_data_handler: BLE packet:");
        for (unsigned int i = 0; i < p_evt->params.rx_data.length; i++)
        	printf("%c", p_evt->params.rx_data.p_data[i]);
        printf("\n");
        for (unsigned int i = 0; i < p_evt->params.rx_data.length; i++)
        	printf("%02x ", p_evt->params.rx_data.p_data[i]);
        printf("\n");
        //NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
#endif
    }

}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
void BleInterface::on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
			NRF_LOG_INFO("Start advertising");
            //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            //APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            // Second chemin de resurrection: ce rearmement etait inconditionnel.
            if (m_advertising_wanted)
                advertising_start();
            break;
		case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
		case BLE_ADV_EVT_DIRECTED:
		case BLE_ADV_EVT_SLOW:
		case BLE_ADV_EVT_FAST_WHITELIST:
		case BLE_ADV_EVT_SLOW_WHITELIST:
		case BLE_ADV_EVT_WHITELIST_REQUEST:
		case BLE_ADV_EVT_PEER_ADDR_REQUEST:
        default:
            break;
    }
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
void BleInterface::on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
void BleInterface::conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
